espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32BG22/Include/efr32bg22_emu.h
/* Bit fields for EMU LOCK */
#define _EMU_LOCK_RESETVALUE                       0x0000ADE8UL                         /**< Default value for EMU_LOCK                  */
#define _EMU_LOCK_MASK                             0x0000FFFFUL                         /**< Mask for EMU_LOCK                           */
#define _EMU_LOCK_LOCKKEY_SHIFT                    0                                    /**< Shift value for EMU_LOCKKEY                 */
#define _EMU_LOCK_LOCKKEY_MASK                     0xFFFFUL                             /**< Bit mask for EMU_LOCKKEY                    */
#define _EMU_LOCK_LOCKKEY_DEFAULT                  0x0000ADE8UL                         /**< Mode DEFAULT for EMU_LOCK                   */
#define _EMU_LOCK_LOCKKEY_UNLOCK                   0x0000ADE8UL                         /**< Mode UNLOCK for EMU_LOCK                    */
#define EMU_LOCK_LOCKKEY_DEFAULT                   (_EMU_LOCK_LOCKKEY_DEFAULT << 0)     /**< Shifted mode DEFAULT for EMU_LOCK           */
#define EMU_LOCK_LOCKKEY_UNLOCK                    (_EMU_LOCK_LOCKKEY_UNLOCK << 0)      /**< Shifted mode UNLOCK for EMU_LOCK            */

/* Bit fields for EMU IF */
#define _EMU_IF_RESETVALUE                         0x00000000UL                         /**< Default value for EMU_IF                    */
#define _EMU_IF_MASK                               0xEB070000UL                         /**< Mask for EMU_IF                             */
#define EMU_IF_AVDDBOD                             (0x1UL << 16)                        /**< AVDD BOD Interrupt flag                     */
#define _EMU_IF_AVDDBOD_SHIFT                      16                                   /**< Shift value for EMU_AVDDBOD                 */
#define _EMU_IF_AVDDBOD_MASK                       0x10000UL                            /**< Bit mask for EMU_AVDDBOD                    */
#define _EMU_IF_AVDDBOD_DEFAULT                    0x00000000UL                         /**< Mode DEFAULT for EMU_IF                     */
#define EMU_IF_AVDDBOD_DEFAULT                     (_EMU_IF_AVDDBOD_DEFAULT << 16)      /**< Shifted mode DEFAULT for EMU_IF             */
#define EMU_IF_IOVDD0BOD                           (0x1UL << 17)                        /**< VDDIO0 BOD Interrupt flag                   */
#define _EMU_IF_IOVDD0BOD_SHIFT                    17                                   /**< Shift value for EMU_IOVDD0BOD               */
#define _EMU_IF_IOVDD0BOD_MASK                     0x20000UL                            /**< Bit mask for EMU_IOVDD0BOD                  */
#define _EMU_IF_IOVDD0BOD_DEFAULT                  0x00000000UL                         /**< Mode DEFAULT for EMU_IF                     */
#define EMU_IF_IOVDD0BOD_DEFAULT                   (_EMU_IF_IOVDD0BOD_DEFAULT << 17)    /**< Shifted mode DEFAULT for EMU_IF             */
#define EMU_IF_EM23WAKEUP                          (0x1UL << 24)                        /**< EM23 Wake up Interrupt flag                 */
#define _EMU_IF_EM23WAKEUP_SHIFT                   24                                   /**< Shift value for EMU_EM23WAKEUP              */
#define _EMU_IF_EM23WAKEUP_MASK                    0x1000000UL                          /**< Bit mask for EMU_EM23WAKEUP                 */
#define _EMU_IF_EM23WAKEUP_DEFAULT                 0x00000000UL                         /**< Mode DEFAULT for EMU_IF                     */
#define EMU_IF_EM23WAKEUP_DEFAULT                  (_EMU_IF_EM23WAKEUP_DEFAULT << 24)   /**< Shifted mode DEFAULT for EMU_IF             */
#define EMU_IF_VSCALEDONE                          (0x1UL << 25)                        /**< Vscale done Interrupt flag                  */
#define _EMU_IF_VSCALEDONE_SHIFT                   25                                   /**< Shift value for EMU_VSCALEDONE              */
#define _EMU_IF_VSCALEDONE_MASK                    0x2000000UL                          /**< Bit mask for EMU_VSCALEDONE                 */
#define _EMU_IF_VSCALEDONE_DEFAULT                 0x00000000UL                         /**< Mode DEFAULT for EMU_IF                     */
#define EMU_IF_VSCALEDONE_DEFAULT                  (_EMU_IF_VSCALEDONE_DEFAULT << 25)   /**< Shifted mode DEFAULT for EMU_IF             */
#define EMU_IF_TEMPAVG                             (0x1UL << 27)                        /**< Temperature Average Interrupt flag          */
#define _EMU_IF_TEMPAVG_SHIFT                      27                                   /**< Shift value for EMU_TEMPAVG                 */
#define _EMU_IF_TEMPAVG_MASK                       0x8000000UL                          /**< Bit mask for EMU_TEMPAVG                    */
#define _EMU_IF_TEMPAVG_DEFAULT                    0x00000000UL                         /**< Mode DEFAULT for EMU_IF                     */
#define EMU_IF_TEMPAVG_DEFAULT                     (_EMU_IF_TEMPAVG_DEFAULT << 27)      /**< Shifted mode DEFAULT for EMU_IF             */
#define EMU_IF_TEMP                                (0x1UL << 29)                        /**< Temperature Interrupt flag                  */
#define _EMU_IF_TEMP_SHIFT                         29                                   /**< Shift value for EMU_TEMP                    */
#define _EMU_IF_TEMP_MASK                          0x20000000UL                         /**< Bit mask for EMU_TEMP                       */
#define _EMU_IF_TEMP_DEFAULT                       0x00000000UL                         /**< Mode DEFAULT for EMU_IF                     */
#define EMU_IF_TEMP_DEFAULT                        (_EMU_IF_TEMP_DEFAULT << 29)         /**< Shifted mode DEFAULT for EMU_IF             */
#define EMU_IF_TEMPLOW                             (0x1UL << 30)                        /**< Temperature low Interrupt flag              */
#define _EMU_IF_TEMPLOW_SHIFT                      30                                   /**< Shift value for EMU_TEMPLOW                 */
#define _EMU_IF_TEMPLOW_MASK                       0x40000000UL                         /**< Bit mask for EMU_TEMPLOW                    */
#define _EMU_IF_TEMPLOW_DEFAULT                    0x00000000UL                         /**< Mode DEFAULT for EMU_IF                     */
#define EMU_IF_TEMPLOW_DEFAULT                     (_EMU_IF_TEMPLOW_DEFAULT << 30)      /**< Shifted mode DEFAULT for EMU_IF             */
#define EMU_IF_TEMPHIGH                            (0x1UL << 31)                        /**< Temperature high Interrupt flag             */
#define _EMU_IF_TEMPHIGH_SHIFT                     31                                   /**< Shift value for EMU_TEMPHIGH                */
#define _EMU_IF_TEMPHIGH_MASK                      0x80000000UL                         /**< Bit mask for EMU_TEMPHIGH                   */
#define _EMU_IF_TEMPHIGH_DEFAULT                   0x00000000UL                         /**< Mode DEFAULT for EMU_IF                     */
#define EMU_IF_TEMPHIGH_DEFAULT                    (_EMU_IF_TEMPHIGH_DEFAULT << 31)     /**< Shifted mode DEFAULT for EMU_IF             */

/* Bit fields for EMU IEN */
#define _EMU_IEN_RESETVALUE                        0x00000000UL                         /**< Default value for EMU_IEN                   */
#define _EMU_IEN_MASK                              0xEB070000UL                         /**< Mask for EMU_IEN                            */
#define EMU_IEN_AVDDBOD                            (0x1UL << 16)                        /**< AVDD BOD Interrupt enable                   */
#define _EMU_IEN_AVDDBOD_SHIFT                     16                                   /**< Shift value for EMU_AVDDBOD                 */
#define _EMU_IEN_AVDDBOD_MASK                      0x10000UL                            /**< Bit mask for EMU_AVDDBOD                    */
#define _EMU_IEN_AVDDBOD_DEFAULT                   0x00000000UL                         /**< Mode DEFAULT for EMU_IEN                    */
#define EMU_IEN_AVDDBOD_DEFAULT                    (_EMU_IEN_AVDDBOD_DEFAULT << 16)     /**< Shifted mode DEFAULT for EMU_IEN            */
#define EMU_IEN_IOVDD0BOD                          (0x1UL << 17)                        /**< VDDIO0 BOD Interrupt enable                 */
#define _EMU_IEN_IOVDD0BOD_SHIFT                   17                                   /**< Shift value for EMU_IOVDD0BOD               */
#define _EMU_IEN_IOVDD0BOD_MASK                    0x20000UL                            /**< Bit mask for EMU_IOVDD0BOD                  */
#define _EMU_IEN_IOVDD0BOD_DEFAULT                 0x00000000UL                         /**< Mode DEFAULT for EMU_IEN                    */
#define EMU_IEN_IOVDD0BOD_DEFAULT                  (_EMU_IEN_IOVDD0BOD_DEFAULT << 17)   /**< Shifted mode DEFAULT for EMU_IEN            */
#define EMU_IEN_EM23WAKEUP                         (0x1UL << 24)                        /**< EM23 Wake up Interrupt enable               */
#define _EMU_IEN_EM23WAKEUP_SHIFT                  24                                   /**< Shift value for EMU_EM23WAKEUP              */
#define _EMU_IEN_EM23WAKEUP_MASK                   0x1000000UL                          /**< Bit mask for EMU_EM23WAKEUP                 */
#define _EMU_IEN_EM23WAKEUP_DEFAULT                0x00000000UL                         /**< Mode DEFAULT for EMU_IEN                    */
#define EMU_IEN_EM23WAKEUP_DEFAULT                 (_EMU_IEN_EM23WAKEUP_DEFAULT << 24)  /**< Shifted mode DEFAULT for EMU_IEN            */
#define EMU_IEN_VSCALEDONE                         (0x1UL << 25)                        /**< Vscale done Interrupt enable                */
#define _EMU_IEN_VSCALEDONE_SHIFT                  25                                   /**< Shift value for EMU_VSCALEDONE              */
#define _EMU_IEN_VSCALEDONE_MASK                   0x2000000UL                          /**< Bit mask for EMU_VSCALEDONE                 */
#define _EMU_IEN_VSCALEDONE_DEFAULT                0x00000000UL                         /**< Mode DEFAULT for EMU_IEN                    */
#define EMU_IEN_VSCALEDONE_DEFAULT                 (_EMU_IEN_VSCALEDONE_DEFAULT << 25)  /**< Shifted mode DEFAULT for EMU_IEN            */
#define EMU_IEN_TEMPAVG                            (0x1UL << 27)                        /**< Temperature Interrupt enable                */
#define _EMU_IEN_TEMPAVG_SHIFT                     27                                   /**< Shift value for EMU_TEMPAVG                 */
#define _EMU_IEN_TEMPAVG_MASK                      0x8000000UL                          /**< Bit mask for EMU_TEMPAVG                    */
#define _EMU_IEN_TEMPAVG_DEFAULT                   0x00000000UL                         /**< Mode DEFAULT for EMU_IEN                    */
#define EMU_IEN_TEMPAVG_DEFAULT                    (_EMU_IEN_TEMPAVG_DEFAULT << 27)     /**< Shifted mode DEFAULT for EMU_IEN            */
#define EMU_IEN_TEMP                               (0x1UL << 29)                        /**< Temperature Interrupt enable                */
#define _EMU_IEN_TEMP_SHIFT                        29                                   /**< Shift value for EMU_TEMP                    */
#define _EMU_IEN_TEMP_MASK                         0x20000000UL                         /**< Bit mask for EMU_TEMP                       */
#define _EMU_IEN_TEMP_DEFAULT                      0x00000000UL                         /**< Mode DEFAULT for EMU_IEN                    */
#define EMU_IEN_TEMP_DEFAULT                       (_EMU_IEN_TEMP_DEFAULT << 29)        /**< Shifted mode DEFAULT for EMU_IEN            */
#define EMU_IEN_TEMPLOW                            (0x1UL << 30)                        /**< Temperature low Interrupt enable            */
#define _EMU_IEN_TEMPLOW_SHIFT                     30                                   /**< Shift value for EMU_TEMPLOW                 */
#define _EMU_IEN_TEMPLOW_MASK                      0x40000000UL                         /**< Bit mask for EMU_TEMPLOW                    */
#define _EMU_IEN_TEMPLOW_DEFAULT                   0x00000000UL                         /**< Mode DEFAULT for EMU_IEN                    */
#define EMU_IEN_TEMPLOW_DEFAULT                    (_EMU_IEN_TEMPLOW_DEFAULT << 30)     /**< Shifted mode DEFAULT for EMU_IEN            */
#define EMU_IEN_TEMPHIGH                           (0x1UL << 31)                        /**< Temperature high Interrupt enable           */
#define _EMU_IEN_TEMPHIGH_SHIFT                    31                                   /**< Shift value for EMU_TEMPHIGH                */
#define _EMU_IEN_TEMPHIGH_MASK                     0x80000000UL                         /**< Bit mask for EMU_TEMPHIGH                   */
#define _EMU_IEN_TEMPHIGH_DEFAULT                  0x00000000UL                         /**< Mode DEFAULT for EMU_IEN                    */
#define EMU_IEN_TEMPHIGH_DEFAULT                   (_EMU_IEN_TEMPHIGH_DEFAULT << 31)    /**< Shifted mode DEFAULT for EMU_IEN            */

/* Bit fields for EMU EM4CTRL */
#define _EMU_EM4CTRL_RESETVALUE                    0x00000000UL                               /**< Default value for EMU_EM4CTRL               */
#define _EMU_EM4CTRL_MASK                          0x00000133UL                               /**< Mask for EMU_EM4CTRL                        */
#define _EMU_EM4CTRL_EM4ENTRY_SHIFT                0                                          /**< Shift value for EMU_EM4ENTRY                */
#define _EMU_EM4CTRL_EM4ENTRY_MASK                 0x3UL                                      /**< Bit mask for EMU_EM4ENTRY                   */
#define _EMU_EM4CTRL_EM4ENTRY_DEFAULT              0x00000000UL                               /**< Mode DEFAULT for EMU_EM4CTRL                */
#define EMU_EM4CTRL_EM4ENTRY_DEFAULT               (_EMU_EM4CTRL_EM4ENTRY_DEFAULT << 0)       /**< Shifted mode DEFAULT for EMU_EM4CTRL        */
#define _EMU_EM4CTRL_EM4IORETMODE_SHIFT            4                                          /**< Shift value for EMU_EM4IORETMODE            */
#define _EMU_EM4CTRL_EM4IORETMODE_MASK             0x30UL                                     /**< Bit mask for EMU_EM4IORETMODE               */
#define _EMU_EM4CTRL_EM4IORETMODE_DEFAULT          0x00000000UL                               /**< Mode DEFAULT for EMU_EM4CTRL                */
#define _EMU_EM4CTRL_EM4IORETMODE_DISABLE          0x00000000UL                               /**< Mode DISABLE for EMU_EM4CTRL                */
#define _EMU_EM4CTRL_EM4IORETMODE_EM4EXIT          0x00000001UL                               /**< Mode EM4EXIT for EMU_EM4CTRL                */
#define _EMU_EM4CTRL_EM4IORETMODE_SWUNLATCH        0x00000002UL                               /**< Mode SWUNLATCH for EMU_EM4CTRL              */
#define EMU_EM4CTRL_EM4IORETMODE_DEFAULT           (_EMU_EM4CTRL_EM4IORETMODE_DEFAULT << 4)   /**< Shifted mode DEFAULT for EMU_EM4CTRL        */
#define EMU_EM4CTRL_EM4IORETMODE_DISABLE           (_EMU_EM4CTRL_EM4IORETMODE_DISABLE << 4)   /**< Shifted mode DISABLE for EMU_EM4CTRL        */
#define EMU_EM4CTRL_EM4IORETMODE_EM4EXIT           (_EMU_EM4CTRL_EM4IORETMODE_EM4EXIT << 4)   /**< Shifted mode EM4EXIT for EMU_EM4CTRL        */
#define EMU_EM4CTRL_EM4IORETMODE_SWUNLATCH         (_EMU_EM4CTRL_EM4IORETMODE_SWUNLATCH << 4) /**< Shifted mode SWUNLATCH for EMU_EM4CTRL      */
#define EMU_EM4CTRL_BOD3SENSEEM4WU                 (0x1UL << 8)                               /**< Set BOD3SENSE as EM4 wakeup                 */
#define _EMU_EM4CTRL_BOD3SENSEEM4WU_SHIFT          8                                          /**< Shift value for EMU_BOD3SENSEEM4WU          */
#define _EMU_EM4CTRL_BOD3SENSEEM4WU_MASK           0x100UL                                    /**< Bit mask for EMU_BOD3SENSEEM4WU             */
#define _EMU_EM4CTRL_BOD3SENSEEM4WU_DEFAULT        0x00000000UL                               /**< Mode DEFAULT for EMU_EM4CTRL                */
#define EMU_EM4CTRL_BOD3SENSEEM4WU_DEFAULT         (_EMU_EM4CTRL_BOD3SENSEEM4WU_DEFAULT << 8) /**< Shifted mode DEFAULT for EMU_EM4CTRL        */

/* Bit fields for EMU CMD */
#define _EMU_CMD_RESETVALUE                        0x00000000UL                         /**< Default value for EMU_CMD                   */
#define _EMU_CMD_MASK                              0x00020E12UL                         /**< Mask for EMU_CMD                            */
#define EMU_CMD_EM4UNLATCH                         (0x1UL << 1)                         /**< EM4 unlatch                                 */
#define _EMU_CMD_EM4UNLATCH_SHIFT                  1                                    /**< Shift value for EMU_EM4UNLATCH              */
#define _EMU_CMD_EM4UNLATCH_MASK                   0x2UL                                /**< Bit mask for EMU_EM4UNLATCH                 */
#define _EMU_CMD_EM4UNLATCH_DEFAULT                0x00000000UL                         /**< Mode DEFAULT for EMU_CMD                    */
#define EMU_CMD_EM4UNLATCH_DEFAULT                 (_EMU_CMD_EM4UNLATCH_DEFAULT << 1)   /**< Shifted mode DEFAULT for EMU_CMD            */
#define EMU_CMD_TEMPAVGREQ                         (0x1UL << 4)                         /**< Temperature Average Request                 */
#define _EMU_CMD_TEMPAVGREQ_SHIFT                  4                                    /**< Shift value for EMU_TEMPAVGREQ              */
#define _EMU_CMD_TEMPAVGREQ_MASK                   0x10UL                               /**< Bit mask for EMU_TEMPAVGREQ                 */
#define _EMU_CMD_TEMPAVGREQ_DEFAULT                0x00000000UL                         /**< Mode DEFAULT for EMU_CMD                    */
#define EMU_CMD_TEMPAVGREQ_DEFAULT                 (_EMU_CMD_TEMPAVGREQ_DEFAULT << 4)   /**< Shifted mode DEFAULT for EMU_CMD            */
#define EMU_CMD_EM01VSCALE1                        (0x1UL << 10)                        /**< Scale voltage to Vscale1                    */
#define _EMU_CMD_EM01VSCALE1_SHIFT                 10                                   /**< Shift value for EMU_EM01VSCALE1             */
#define _EMU_CMD_EM01VSCALE1_MASK                  0x400UL                              /**< Bit mask for EMU_EM01VSCALE1                */
#define _EMU_CMD_EM01VSCALE1_DEFAULT               0x00000000UL                         /**< Mode DEFAULT for EMU_CMD                    */
#define EMU_CMD_EM01VSCALE1_DEFAULT                (_EMU_CMD_EM01VSCALE1_DEFAULT << 10) /**< Shifted mode DEFAULT for EMU_CMD            */
#define EMU_CMD_EM01VSCALE2                        (0x1UL << 11)                        /**< Scale voltage to Vscale2                    */
#define _EMU_CMD_EM01VSCALE2_SHIFT                 11                                   /**< Shift value for EMU_EM01VSCALE2             */
#define _EMU_CMD_EM01VSCALE2_MASK                  0x800UL                              /**< Bit mask for EMU_EM01VSCALE2                */
#define _EMU_CMD_EM01VSCALE2_DEFAULT               0x00000000UL                         /**< Mode DEFAULT for EMU_CMD                    */
#define EMU_CMD_EM01VSCALE2_DEFAULT                (_EMU_CMD_EM01VSCALE2_DEFAULT << 11) /**< Shifted mode DEFAULT for EMU_CMD            */
#define EMU_CMD_RSTCAUSECLR                        (0x1UL << 17)                        /**< Reset Cause Clear                           */
#define _EMU_CMD_RSTCAUSECLR_SHIFT                 17                                   /**< Shift value for EMU_RSTCAUSECLR             */
#define _EMU_CMD_RSTCAUSECLR_MASK                  0x20000UL                            /**< Bit mask for EMU_RSTCAUSECLR                */
#define _EMU_CMD_RSTCAUSECLR_DEFAULT               0x00000000UL                         /**< Mode DEFAULT for EMU_CMD                    */
#define EMU_CMD_RSTCAUSECLR_DEFAULT                (_EMU_CMD_RSTCAUSECLR_DEFAULT << 17) /**< Shifted mode DEFAULT for EMU_CMD            */

